api/templates.xml

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE templates [
<!ENTITY ad-credentials "
<adin:ADLoginRequest>
    <adin:user>dGarcia</adin:user>
    <adin:pass>dGarcia</adin:pass>
    <adin:lang>es_VE</adin:lang>
    <adin:ClientID>1000000</adin:ClientID>
    <adin:RoleID>1000000</adin:RoleID>
    <adin:OrgID>0</adin:OrgID>
    <adin:WarehouseID>0</adin:WarehouseID>
    <adin:stage>0</adin:stage>
</adin:ADLoginRequest>">
]>
<queries>
    <!-- Confirmar factura -->
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
        <soapenv:Header/>
        <soapenv:Body>
            <adin:updateData>
                <adin:ModelCRUDRequest>
                    <adin:ModelCRUD>
                    <adin:serviceType>UpdateIsConfirmInvoice</adin:serviceType>
                    <adin:RecordID></adin:RecordID>
                    <adin:DataRow>
                        <adin:field column="is_confirm">
                            <adin:val>Y</adin:val>
                        </adin:field>
                            <adin:field column="ship_app">
                            <adin:val></adin:val>
                        </adin:field>
                    </adin:DataRow>
                    </adin:ModelCRUD>
                    &ad-credentials;
                </adin:ModelCRUDRequest>
            </adin:updateData>
        </soapenv:Body>
    </soapenv:Envelope>
    <!-- Confirmar entrega -->
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
        <soapenv:Header/>
        <soapenv:Body>
            <adin:updateData>
                <adin:ModelCRUDRequest>
                    <adin:ModelCRUD>
                    <adin:serviceType>UpdateIsConfirmInOut</adin:serviceType>
                    <adin:RecordID></adin:RecordID>
                    <adin:DataRow>
                        <adin:field column="is_confirm">
                            <adin:val>Y</adin:val>
                        </adin:field>
                        <adin:field column="ship_app">
                            <adin:val></adin:val>
                        </adin:field>
                    </adin:DataRow>
                    </adin:ModelCRUD>
                    &ad-credentials;
                </adin:ModelCRUDRequest>
            </adin:updateData>
        </soapenv:Body>
    </soapenv:Envelope>
    <!-- Crear devolucion -->
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
        <soapenv:Header/>
        <soapenv:Body>
            <adin:createData>
                <adin:ModelCRUDRequest>
                    <adin:ModelCRUD>
                        <adin:serviceType>CreateOrderPedidos</adin:serviceType>
                        <adin:TableName>C_Order</adin:TableName>
                        <adin:RecordID>0</adin:RecordID>
                        <adin:Action>Create</adin:Action>
                        <adin:PageNo>0</adin:PageNo>
                        <adin:DataRow>
                            <adin:field column="Description">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="C_BPartner_ID">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="AD_Client_ID">
                                <adin:val>1000000</adin:val>
                            </adin:field>
                            <adin:field column="AD_Org_ID">
                                <adin:val>1000009</adin:val>
                            </adin:field>
                            <adin:field column="C_DocTypeTarget_ID">
                                <adin:val>1000790</adin:val>
                            </adin:field>
                            <adin:field column="M_Warehouse_ID">
                                <adin:val>1000058</adin:val>
                            </adin:field>
                        </adin:DataRow>
                    </adin:ModelCRUD>
                    &ad-credentials;
                </adin:ModelCRUDRequest>
            </adin:createData>
        </soapenv:Body>
    </soapenv:Envelope>
    <!-- Crear lineas de devolucion -->
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
        <soapenv:Header/>
        <soapenv:Body>
            <adin:createData>
                <adin:ModelCRUDRequest>
                    <adin:ModelCRUD>
                        <adin:serviceType>CreateOrderLinePedidos</adin:serviceType>
                        <adin:TableName>C_OrderLine</adin:TableName>
                        <adin:RecordID>0</adin:RecordID>
                        <adin:Action>Create</adin:Action>
                        <adin:PageNo>0</adin:PageNo>
                        <adin:DataRow>
                            <adin:field column="C_Order_ID">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="M_Product_ID">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="QtyEntered">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="Description">
                                <adin:val></adin:val>
                            </adin:field>
                            <adin:field column="AD_Client_ID">
                                <adin:val>1000000</adin:val>
                            </adin:field>
                            <adin:field column="AD_Org_ID">
                                <adin:val>1000009</adin:val>
                            </adin:field>
                        </adin:DataRow>
                    </adin:ModelCRUD>
                    &ad-credentials;
                </adin:ModelCRUDRequest>
            </adin:createData>
        </soapenv:Body>
    </soapenv:Envelope>
</queries>